In [22]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

Look at the shape of each DataFrame - how many rows? How many columns?

Take a look at the datatypes for the columns in each DataFrame.

Take a look at the last 10 rows of each DataFrame in turn.

In [58]:
gdp_df=pd.read_csv('data/gdp_percapita.csv')
#gdp_df.head(6)
#gdp_df.info()
gdp_df.shape
#print(gdp_df.dtypes)
#gdp_df.tail(10)

(6608, 4)

In [60]:
internet_df=pd.read_csv('data/internet_use.csv')
#internet_df.head(6)
#internet_df.info()
internet_df.shape
#print(gdp_df.dtypes)
#internet_df.tail(10)

(4677, 4)

Drop the value footnotes column from both DataFrames. Check that this worked as expected.

In [67]:
#gdp_df.drop(columns='Value Footnotes', inplace=True) 
gdp_df.shape #the column still seems to be part of the dataframe and not actually deleted in the original .csv file
gdp_df.head(6)

  Country or Area  Year        Value
0     Afghanistan  2018  2190.240321
1     Afghanistan  2017  2202.570851
2     Afghanistan  2016  2200.764487
3     Afghanistan  2015  2212.750899
4     Afghanistan  2014  2249.253738
5     Afghanistan  2013  2264.317575

       Country  Year  GDP_Per_Capita
0  Afghanistan  2018     2190.240321
1  Afghanistan  2017     2202.570851
2  Afghanistan  2016     2200.764487
3  Afghanistan  2015     2212.750899
4  Afghanistan  2014     2249.253738
5  Afghanistan  2013     2264.317575

In [68]:
#internet_df.drop(columns='Value Footnotes', inplace=True)
internet_df.shape
internet_df.head(6)

  Country or Area  Year     Value
0     Afghanistan  2014  6.390000
1     Afghanistan  2013  5.900000
2     Afghanistan  2012  5.454545
3     Afghanistan  2011  5.000000
4     Afghanistan  2010  4.000000
5     Afghanistan  2009  3.550000

Change the columns for the GDP Per Capita DataFrame to ‘Country’, ‘Year’, and ‘GDP_Per_Capita’.

In [81]:
gdp_df.columns = ['Country', 'Year', 'GDP_Per_Capita']
gdp_df.head()

       Country  Year  GDP_Per_Capita
0  Afghanistan  2018     2190.240321
1  Afghanistan  2017     2202.570851
2  Afghanistan  2016     2200.764487
3  Afghanistan  2015     2212.750899
4  Afghanistan  2014     2249.253738

Change the columns for the Internet Users DataFrame to ‘Country’, ‘Year’, and ‘Internet_Users_Pct’.

In [83]:
internet_df.columns = ['Country','Year','Internet_Users_Pct']
internet_df.head()

       Country  Year  Internet_Users_Pct
0  Afghanistan  2014            6.390000
1  Afghanistan  2013            5.900000
2  Afghanistan  2012            5.454545
3  Afghanistan  2011            5.000000
4  Afghanistan  2010            4.000000

Merge the two DataFrames to one. Merge all rows from each of the two DataFrames. Call the new DataFrame gdp_and_internet_use.

In [93]:
gdp_and_internet_use=gdp_df.merge(internet_df, on=["Country","Year"], how='outer')

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7847 entries, 0 to 7846
Data columns (total 4 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Country             7846 non-null   object
 1   Year                7846 non-null   object
 2   GDP_Per_Capita      6606 non-null   float64
 3   Internet_Users_Pct  4495 non-null   float64
dtypes: float64(2), object(2)
memory usage: 306.5+ KB

In [99]:
gdp_and_internet_use.head(10)
#gdp_and_internet_use.tail(10)

       Country  Year  GDP_Per_Capita  Internet_Users_Pct
0  Afghanistan  2018     2190.240321                 NaN
1  Afghanistan  2017     2202.570851                 NaN
2  Afghanistan  2016     2200.764487                 NaN
3  Afghanistan  2015     2212.750899                 NaN
4  Afghanistan  2014     2249.253738            6.390000
5  Afghanistan  2013     2264.317575            5.900000
6  Afghanistan  2012     2220.481526            5.454545
7  Afghanistan  2011     2037.608607            5.000000
8  Afghanistan  2010     2093.743565            4.000000
9  Afghanistan  2009     1881.777626            3.550000

Subset the combined DataFrame to keep only the data for 2004, 2009, and 2014. Check that this happened correctly.

In [114]:
filtered_years=gdp_and_internet_use[(gdp_and_internet_use.Year == '2004') | (gdp_and_internet_use.Year == '2009') | (gdp_and_internet_use.Year == '2014')]
print(test)

                    Country  Year  GDP_Per_Capita  Internet_Users_Pct
4               Afghanistan  2014     2249.253738            6.390000
9               Afghanistan  2009     1881.777626            3.550000
14              Afghanistan  2004     1284.127338            0.105809
21                  Albania  2014    11828.232264           60.100000
26                  Albania  2009    10528.778102           41.200000
...                     ...   ...             ...                 ...
7629  Virgin Islands (U.S.)  2009             NaN           27.396510
7634  Virgin Islands (U.S.)  2004             NaN           27.377009
7646                  Yemen  2014             NaN           22.550000
7651                  Yemen  2009             NaN            9.960000
7656                  Yemen  2004             NaN            0.881223

[830 rows x 4 columns]

Create three new DataFrames, one for 2004, one for 2009, and one for 2014. Give them meaningful names that aren't too long.

In [115]:
gdp_and_internet_use_04 = gdp_and_internet_use[gdp_and_internet_use.Year == '2004']
gdp_and_internet_use_09 = gdp_and_internet_use[gdp_and_internet_use.Year == '2009']
gdp_and_internet_use_14 = gdp_and_internet_use[gdp_and_internet_use.Year == '2014']

In [118]:
print(gdp_and_internet_use_14)

                    Country  Year  GDP_Per_Capita  Internet_Users_Pct
4               Afghanistan  2014     2249.253738                6.39
21                  Albania  2014    11828.232264               60.10
50                  Algeria  2014    11329.428688               18.09
79                   Angola  2014     8239.832077               21.26
108     Antigua and Barbuda  2014    18104.241470               64.00
...                     ...   ...             ...                 ...
7522     T.F.Y.R. Macedonia  2014             NaN               68.06
7580              Venezuela  2014             NaN               57.00
7604               Viet Nam  2014             NaN               48.31
7624  Virgin Islands (U.S.)  2014             NaN               50.07
7646                  Yemen  2014             NaN               22.55

[277 rows x 4 columns]

Which country had the highest percentage of internet users in 2014? What was the percentage? (Try typing the first 3 letters of your DataFrame name and hitting the tab key for auto-complete options).
Repeat for 2004 and 2009.

In [134]:
#gdp_and_internet_use_14.sort_values('Internet_Users_Pct', ascending=False)
#gdp_and_internet_use_09.sort_values('Internet_Users_Pct', ascending=False)
gdp_and_internet_use_04.sort_values('Internet_Users_Pct', ascending=False)

                  Country  Year  GDP_Per_Capita  Internet_Users_Pct
5785               Sweden  2004    45029.814344               83.89
2517              Iceland  2004    45380.965464               83.88
1384              Denmark  2004    50566.988088               80.93
4471               Norway  2004    59647.501415               77.69
7161      Korea (Rep. of)  2004             NaN               72.70
...                   ...   ...             ...                 ...
6189               Tuvalu  2004     3341.738017                 NaN
6363  Upper middle income  2004     8561.878030                 NaN
6479              Vietnam  2004     3689.732423                 NaN
6508   West Bank and Gaza  2004     4113.246936                 NaN
6533                World  2004    12070.457345                 NaN

[276 rows x 4 columns]

Which country had the lowest percentage of internet users in 2014? What was the percentage?
Repeat for 2004 and 2009.

In [136]:
#gdp_and_internet_use_14.sort_values('Internet_Users_Pct', ascending=True)
#gdp_and_internet_use_09.sort_values('Internet_Users_Pct', ascending=True)
gdp_and_internet_use_04.sort_values('Internet_Users_Pct', ascending=True)

                          Country  Year  GDP_Per_Capita  Internet_Users_Pct
6849  Dem. People's Rep. of Korea  2004             NaN            0.000000
4166                      Myanmar  2004     1696.881760            0.024337
3395                      Liberia  2004     1181.546158            0.031011
5843                   Tajikistan  2004     1737.743630            0.077480
14                    Afghanistan  2004     1284.127338            0.105809
...                           ...   ...             ...                 ...
6189                       Tuvalu  2004     3341.738017                 NaN
6363          Upper middle income  2004     8561.878030                 NaN
6479                      Vietnam  2004     3689.732423                 NaN
6508           West Bank and Gaza  2004     4113.246936                 NaN
6533                        World  2004    12070.457345                 NaN

[276 rows x 4 columns]